// На этой недели у нас современный фронт
// Мы будем смотреть как собираються проекты ( в базовом варианте) и выучим полезные фишки
// А также работа с терминалом (Вам необходимо с ним научиться работать на уровне базового пользователя)
// - навигация
// - удаление 
// - создание
// - просто понимание чего тут написанно 
// - умение читать текствоый контенкт который будет тут отображаться

// Терминал - это неграфический интерфейс для работы с вашей файловой системой а также с операционой системой
// у вас есть проводник и вы папочки перемещаете и переменуете их создаете и ходите межжду них
// тоже самое можно сделать с терминала

// Нам для разработчиков терминал нужен для запуска всяких утилит 9потому что большинство утилит не существует ввиде графического интерфейса
// они все есть только в терминале
// Есть внешний терминал и есть внутрений терминал 

// Как открыть терминал - `control + ~` две кнопки нажали

// Команды - это программы у вас на винде это встроенные уитилиты которые можно из консоли вызвать из терминала